#+property: header-args :dir ../source/ :cache yes :noweb yes :exports code :eval no :results output
#+options: toc:nil num:nil

#+title: Sensor Port 
#+author: Lewis Collum

*** COMMENT ip                                                   :deprecated:
 #+BEGIN_SRC python :tangle ../source/ip.py
import subprocess

<<ip.local>>
 #+END_SRC

 #+name: ip.local
 #+BEGIN_SRC python
def local():
    command = 'ip addr | grep "global" | egrep -o "[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}" | head -n1'
    process = subprocess.run(command, shell=True, check=True, encoding='utf-8', stdout=subprocess.PIPE)
    ip = process.stdout.split()
    if not ip: raise RuntimeError("No Network Connection")
    return ip[0]
 #+END_SRC

 #+BEGIN_SRC python :eval no-export
import ip
print(ip.local())
 #+END_SRC

 #+RESULTS[9ab9e9195a7e776c05bb1649a5967ef8e84217de]:
 : 192.168.0.101

** alias matrix variable
#+BEGIN_SRC python :eval no-export
import numpy
import enum

class State(enum.IntEnum):
    position = 0
    velocity = 1
    
state = numpy.array([1, 2])
velocity = state[1]
position = state[0]
print("pos:", state[State.position])
print("vel:", state[State.velocity])

state[1] = 4
print("pos:", state[State.position])
print("vel:", state[State.velocity])
#+END_SRC

#+RESULTS[4799896116125a2a317139001fa4e057c69bf34c]:
: pos: 1
: vel: 2
: pos: 1
: vel: 4
** plane tracking (kalman)
#+BEGIN_SRC python :eval no-export
import numpy as np
from numpy.linalg import inv

x_observations = np.array([4000, 4260, 4550, 4860, 5110])
v_observations = np.array([280, 282, 285, 286, 290])

z = np.c_[x_observations, v_observations]

# Initial Conditions
a = 2  # Acceleration
v = 280
t = 1  # Difference in time

# Process / Estimation Errors
error_est_x = 20
error_est_v = 5

# Observation Errors
error_obs_x = 25  # Uncertainty in the measurement
error_obs_v = 6

def prediction2d(x, v, t, a):
    A = np.array([[1, t],
                  [0, 1]])
    X = np.array([[x],
                  [v]])
    B = np.array([[0.5 * t ** 2],
                  [t]])
    X_prime = A.dot(X) + B.dot(a)
    return X_prime


def covariance2d(sigma1, sigma2):
    cov1_2 = sigma1 * sigma2
    cov2_1 = sigma2 * sigma1
    cov_matrix = np.array([[sigma1 ** 2, cov1_2],
                           [cov2_1, sigma2 ** 2]])
    return np.diag(np.diag(cov_matrix))


# Initial Estimation Covariance Matrix
P = covariance2d(error_est_x, error_est_v)
A = np.array([[1, t],
              [0, 1]])

# Initial State Matrix
X = np.array([[z[0][0]],
              [v]])
n = len(z[0])

for data in z[1:]:
    X = prediction2d(X[0][0], X[1][0], t, a)
    # To simplify the problem, professor
    # set off-diagonal terms to 0.
    P = np.diag(np.diag(A.dot(P).dot(A.T)))

    # Calculating the Kalman Gain
    H = np.identity(n)
    R = covariance2d(error_obs_x, error_obs_v)
    S = H.dot(P).dot(H.T) + R
    K = P.dot(H).dot(inv(S))

    # Reshape the new data into the measurement space.
    Y = H.dot(data).reshape(n, -1)

    # Update the State Matrix
    # Combination of the predicted state, measured values, covariance matrix and Kalman Gain
    X = X + K.dot(Y - H.dot(X))

    # Update Process Covariance Matrix
    P = (np.identity(len(K)) - K.dot(H)).dot(P)
    print("X:", X)
    print("P:", P)

print("Kalman Filter State Matrix:\n", X)
#+END_SRC

#+RESULTS[563ec8fbda592c500f687496fc37cc4a01753429]:
#+begin_example
X: [[4272.5]
 [ 282. ]]
P: [[252.97619048   0.        ]
 [  0.          14.75409836]]
X: [[4553.85054707]
 [ 284.29069767]]
P: [[187.4378327    0.        ]
 [  0.          10.46511628]]
X: [[4844.15764332]
 [ 286.22522523]]
P: [[150.30854278   0.        ]
 [  0.           8.10810811]]
X: [[5127.05898493]
 [ 288.55147059]]
P: [[126.38282157   0.        ]
 [  0.           6.61764706]]
Kalman Filter State Matrix:
 [[5127.05898493]
 [ 288.55147059]]
#+end_example
*
** numpy ndarray
 #+BEGIN_SRC python :eval no-export
import numpy

A = numpy.eye(6)
A[0:3, 3:6] = 2*numpy.eye(3)
#A = numpy.hstack((numpy.array([*numpy.eye(3), *numpy.eye(3)*2]), numpy.array([*numpy.zeros([3,3]), *numpy.eye(3)])))
print(A)
 #+END_SRC

 #+RESULTS[c2fea3356f7ba157f983b21c8e180a9c84903dec]:
 : [[1. 0. 0. 2. 0. 0.]
 :  [0. 1. 0. 0. 2. 0.]
 :  [0. 0. 1. 0. 0. 2.]
 :  [0. 0. 0. 1. 0. 0.]
 :  [0. 0. 0. 0. 1. 0.]
 :  [0. 0. 0. 0. 0. 1.]]

** transpose 3x9
#+BEGIN_SRC python :eval no-export
import numpy
H = numpy.hstack((numpy.zeros((3, 6)), numpy.eye(3)))
print(H)
print(H.T);

#+END_SRC

#+RESULTS[990d6266bc08304c4e82ce6ea39ec984e1ae8318]:
#+begin_example
[[0. 0. 0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 1.]]
[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]
#+end_example

** quaternion hamiltonian product
#+BEGIN_SRC python :eval no-export
import numpy
w1 = 1
w2 = 10
a = numpy.array([1, 2, 3])
b = numpy.array([2, 3, 4])
c = a*b
print(w1*w2-sum(c))

print(sum(a**2))

#+END_SRC

#+RESULTS[e19a4225ef6cb94074f406f493ba41c941abb820]:
: -10
: 14

** dict from list
#+BEGIN_SRC python :eval no-export
l = ["A", "B"]
d = {i: None for i in l}
print(d)

d = dict.fromkeys(l)
print(d)
#+END_SRC

#+RESULTS[420b00e48f63f7ae914bd04b0137135ba2400479]:
: {'A': None, 'B': None}
: {'A': None, 'B': None}

** clear dict values
#+BEGIN_SRC python :eval no-export
d = {"A": 1, "B": 2}
d = dict.fromkeys(d)
print(d)
#+END_SRC

#+RESULTS[d0c2a8905c7aa127e44889b5784960c338a222a2]:
: {'A': None, 'B': None}

** list from list (checking numpy array compatability)
#+BEGIN_SRC python :eval no-export
import numpy
vector = [1, 2, 3]
a = list(vector)
b = numpy.array(vector)
print(a)
print(b)
#+END_SRC

#+RESULTS[ad06cfbafab1c9bc9dac16ae92c212c99d84b011]:
: [1, 2, 3]
: [1 2 3]

** list from list and value
#+BEGIN_SRC python :eval no-export
a = [1, 2, 3]
b = 4.3
c = list([*a, b])
print(c)

import numpy
a = numpy.asarray(a)
c = numpy.array([*a, b])
print(c)
#+END_SRC

#+RESULTS[46e762ce8de75bca8876337649aa6ce502640afb]:
: [1, 2, 3, 4.3]
: [1.  2.  3.  4.3]

